src/Catalogs/УсловияИсключительныхСитуаций/УсловияИсключительныхСитуаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УсловияИсключительныхСитуаций</name>
  <owners>Catalog.ИсключительныеСитуации</owners>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Критерии</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>EnumRef.ВидыКритериев</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеCRC32</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ТехнологическийЖурнал/ТехнологическийЖурнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТехнологическийЖурнал</name>
  <resources>
    <name>МоментВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторСоединения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Контекст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КонтекстХэш</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодИсключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстИсключения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТекстИсключенияХэш</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДробныеСекунды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Продолжительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КлиентскоеПриложение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнформационнаяБазаВСтроку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторTCPСоединения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусHTTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаголовкиHTTP</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>УникальныйИдентификаторСеанса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дубликат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГоловнаяЗапись</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Действие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидБлокировки</name>
    <type>
      <types>EnumRef.ВидыБлокировок</types>
    </type>
  </resources>
  <resources>
    <name>Интерфейс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Метод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипВСтроку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоследняяСтрокаТекстаИсключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоследняяСтрокаКонтекста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсключительнаяСитуация</name>
    <type>
      <types>CatalogRef.ИсключительныеСитуации</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.СобытияТЖ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кластер</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочийСервер</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФайлЖурнала</name>
    <type>
      <types>CatalogRef.ФайлыЖурнала</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/УсловияИсключительныхСитуаций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаписатьЭлемент(Знач ПараметрыЗадания, Знач АдресХранилища) Экспорт
	
	//ТекущийОбъект = ДанныеФормыВЗначение(ПараметрыЗадания.ЗаписываемыйОбъект, Тип("СправочникОбъект.УсловияИсключительныхСитуаций"));
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ПараметрыЗадания.ЗаписываемыйОбъект);
	ТекущийОбъект = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	Если ПараметрыЗадания.УдаляемыеИсключения <> Неопределено Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("УдаляемыеИсключения", ПараметрыЗадания.УдаляемыеИсключения);
	КонецЕсли;
	ТекущийОбъект.Записать();
	ПоместитьВоВременноеХранилище(ТекущийОбъект.Ссылка, АдресХранилища);
	
КонецПроцедуры

Процедура УдалитьУсловия(Знач ПараметрыЗадания, Знач АдресХранилища) Экспорт
	
	НачатьТранзакцию();
	Попытка
		Для Каждого Условие Из ПараметрыЗадания.УдаляемыеУсловия Цикл
			
			ИсключительнаяСитуация = Условие.Владелец;
			Удаление = Новый УдалениеОбъекта(Условие);
			Удаление.Записать();
			
		КонецЦикла;
		ОбновитьЗаписиЖурнала(ИсключительнаяСитуация);
		ЗафиксироватьТранзакцию();
	Исключение
		Инфо = ИнформацияОбОшибке();
		Комментарий =
			"Описание = '" +Инфо.Описание + "', " +
			"ИмяМодуля = '" + Инфо.ИмяМодуля + "', " +
			"НомерСтроки = '" + Инфо.НомерСтроки + "', " +
			"ИсходнаяСтрока = '" + Инфо.ИсходнаяСтрока + "'.";
			
		ЗаписьЖурналаРегистрации(
			"Процедура УдалитьУсловия(Знач ПараметрыЗадания, Знач АдресХранилища) Экспорт",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.УсловияИсключительныхСитуаций.МодульМенеджера,
			,
			Комментарий);
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьЗаписиЖурнала(Знач ИсключительнаяСитуация)
	
	НовыеСобытия = Техжурнал.НайтиОсиротевшиеСтрокиЖурнала(ИсключительнаяСитуация);
	Если НовыеСобытия.Количество() > 0 Тогда
		НовыеСобытия.ЗаполнитьЗначения(Справочники.ИсключительныеСитуации.ПустаяСсылка(), "ИсключительнаяСитуация");
		ИмпортТехжурналаИсключения.СобратьИсключения(НовыеСобытия);
		
		Набор = РегистрыСведений.ТехнологическийЖурнал.СоздатьНаборЗаписей();
		Для Каждого Строка Из НовыеСобытия Цикл
			
			Набор.Очистить();
			Набор.Отбор.УникальныйИдентификатор.Установить(Строка.УникальныйИдентификатор);
			Запись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Строка);
			Набор.Записать();
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецЕсли
